[
  {
    "name": "ARMOR",
    "description": "All kinetic, energy, and explosive damage is reduced by an amount equal to a character’s ARMOR. Mechs can’t have more than 4 ARMOR."
  },
  {
    "name": "BONUS DAMAGE",
    "description": "Extra damage – kinetic, energy or explosive– that is added onto melee or ranged attacks. Attacks that target more than one character only deal half bonus damage."
  },
  {
    "name": "CHARACTER",
    "description": "A player character (PC), non-player character, (NPC), or any other entity capable of acting (or reacting) independently, such as DRONES."
  },
  {
    "name": "DAMAGE",
    "description": "Damage taken is subtracted from HP, and is either kinetic, explosive, energy, or burn."
  },
  {
    "name": "E-DEFENSE",
    "description": "The statistic used to defend against tech attacks."
  },
  {
    "name": "EVASION",
    "description": "The statistic used to defend against most melee and ranged attacks."
  },
  {
    "name": "GRIT",
    "description": "Half of a character’s LL (rounded up), representing their experience in combat. GRIT provides bonuses to some rolls and traits."
  },
  {
    "name": "HEAT",
    "description": "Heat taken by a target represents harm to internal systems and reactor shielding. It fills in HEAT CAP."
  },
  {
    "name": "HEAT CAP",
    "description": "The amount of heat a mech can take before it is at risk of overheating."
  },
  {
    "name": "HIT POINTS (HP)",
    "description": "The amount of damage a pilot can receive before going DOWN AND OUT, and the amount of damage a mech can receive before it takes structure damage."
  },
  {
    "name": "IMMUNITY",
    "description": "Characters with IMMUNITY ignore all damage and effects from whatever they are immune to."
  },
  {
    "name": "RANGE",
    "description": "The maximum range at which a weapon can be used for ranged attacks, measured from the attacking character."
  },
  {
    "name": "REPAIR CAP",
    "description": "The number of times a mech can be repaired per mission."
  },
  {
    "name": "RESISTANCE",
    "description": "Characters with RESISTANCE reduce damage, heat, or a type of damage, by half, after ARMOR has been applied. RESISTANCE to the same type of damage does not stack."
  },
  {
    "name": "STRESS",
    "description": "All PC mechs (and some NPCs) have a certain amount of STRESS – generally 4 STRESS for PCs. This is the amount of stress damage they can take before they suffer a reactor meltdown. When mechs exceed their HEAT CAP, they take 1 stress damage and make an overheating check."
  },
  {
    "name": "STRUCTURE",
    "description": "All PC mechs (and some NPCs) have a certain amount of STRUCTURE – generally 4 STRUCTURE for PCs. This is the amount of structure damage they can take before they are destroyed. When mechs reach 0 HP, they take 1 structure damage and make a structure check."
  },
  {
    "name": "SENSORS",
    "description": "The maximum range at which you can detect other characters, make tech attacks, LOCK ON, and use some systems."
  },
  {
    "name": "SIZE",
    "description": "The number of spaces that are occupied or controlled by a character or object. For example, SIZE 2 mechs occupy an area 2 spaces on each side and 2 spaces high. SIZE doesn’t necessarily represent precise physical dimensions."
  },
  {
    "name": "SPEED",
    "description": "The number of spaces a character can move with a standard move or BOOST."
  },
  {
    "name": "TECH ATTACK",
    "description": "The statistic used to make tech attacks and to take most tech actions."
  },
  {
    "name": "THREAT",
    "description": "The maximum range at which melee and overwatch attacks can be made with certain weapons, measured from the attacking character. All weapons have THREAT 1 unless specified otherwise."
  }
]