[
  {
    "id": "t_ace",
    "name": "ACE",
    "description": "Every pilot brags about their abilities; occasionally, some even have the reputation to back it up. Harmonious Domesticity is one of these pilots. As an cce, they aren't just ranked among the most qualified of pilots - they're among the most qualified of lancers.<br>Whether you're a talented rookie or a grizzled veteran, you're one of these aces. Your skills as a pilot are notorious enough that your callsign is known throughout the system.",
    "ranks": [
      {
        "name": "ACROBATICS",
        "description": "While flying, you get the following benefits:<li>You make all AGILITY checks and saves with +1 ACCURACY.<li>Any time an attack misses you, you may fly up to 2 spaces in any direction as a reaction."
      },
      {
        "name": "AFTERBURNERS",
        "description": "When you BOOST while flying, you may move an additional 1d6 spaces, but take heat equal to half that amount."
      },
      {
        "name": "SUPERSONIC",
        "description": "As a quick action on your turn, you may spin up your thrusters. If you end your turn flying, you may nominate a character within a RANGE equal to your SPEED and line of sight. As a reaction at the end of your target's turn, you may fly to a space that is free and adjacent to them. There must be a path to do so, but you can move even if the nominated character is no longer within your movement range or line of sight. This movement ignores engagement and does not provoke reactions."
      }
    ]
  },
  {
    "id": "t_bonded",
    "name": "BONDED",
    "description": "The galaxy is a dangerous place, and everyone should have a friend to watch their back. Luckily, you've found yours. Maybe you enlisted together or were the only survivors of a bloody engagement. Maybe you didn't start out as friends, or maybe you were raised to fight alongside each other - however your friendship came to be, when it comes time to drop, there's no one you'd rather have at your side. Alone, you're deadly; together, you're a force of nature.",
    "ranks": [
      {
        "name": "I'M YOUR HUCKLEBERRY",
        "description": "When you take this talent, choose another pilot (hopefully a PC, but NPCs are fine if your GM allows it) to be your BONDMATE. Any mech skill checks and saves either character makes while you are adjacent gains +1 ACCURACY. If both characters have this talent, this increases to +2 ACCURACY, but additional characters with this talent can't increase it any further.<br>Between missions, you can replace your BONDMATE with a new one, but only if your relationship with them has changed."
      },
      {
        "name": "SUNDANCE",
        "description": "Gain the following reaction:<br>SUNDANCE<br>Reaction<br>1/round, when you are adjacent to your BONDMATE (pilot or mech) and they take damage from a source within your line of sight, you may take the damage instead."
      },
      {
        "name": "COVER ME!",
        "description": "If a character within your line of sight attempts to attack your bondmate, you can spend your OVERWATCH to threaten the attacker, forcing them to either choose a different target or attack anyway: if they attack a different target, your OVERWATCH is expended without effect; if they choose to attack anyway, you can immediately attack them with OVERWATCH, as long as they are within RANGE and line of sight. This attack resolves before the triggering attack."
      }
    ]
  },
  {
    "id": "t_brawler",
    "name": "BRAWLER",
    "description": "Up close and personal. The way battle was done since the dawn of time, then forgotten with the first spark of gunpowder. Tempest Gloire is one pilot who prefers the old ways: hand-to-hand, weapons discarded, just the strength of her machine versus the strength of all others. She - and you - know that the sweetest victory is found at the culmination of a dance as old as war itself, with the first trick known to humanity: a fist to your enemy's face.",
    "ranks": [
      {
        "name": "HOLD AND LOCK",
        "description": "You gain +1 ACCURACY on all melee attacks against targets you are grappling."
      },
      {
        "name": "SLEDGEHAMMER",
        "description": "Your IMPROVISED ATTACKS gain KNOCKBACK 2 and deal 2d6+2 kinetic damage."
      },
      {
        "name": "KNOCKOUT BLOW",
        "description": "Gain a BRAWLER DIE, 1d6 starting at 6. Each time you GRAPPLE, RAM, or make an IMPROVISED ATTACK, lower the value of the BRAWLER DIE by 1.<br>When the BRAWLER DIE reaches 1, you may reset it to 6 and, as make a knockout blow against an adjacent character as a full action. They must succeed on a HULL save, or take 2d6+2 kinetic damage and become STUNNED until the end of their next turn.<br>The value of your BRAWLER DIE persists between scenes, but it resets to 6 when you rest or perform a FULL REPAIR."
      }
    ],
    "counters": [
      {
        "id": "ctr_brawler",
        "name": "BRAWLER DIE",
        "default_value": 6,
        "min": 1,
        "max": 6
      }
    ]
  },
  {
    "id": "t_brutal",
    "name": "BRUTAL",
    "description": "In the practice ring as in live combat, Aubrey Deckard only knows one way to fight: as fast and messy as possible. When others go hard, she goes hardest; when the order is to eliminate the enemy, she does so with prejudice. This isn't a dance, it isn't a game - it's war, and Brutal lancers mean to see it through. If that means becoming a little bit of a monster, then so be it: the dead can hate from the grave.",
    "ranks": [
      {
        "name": "PREDATOR",
        "description": "When you roll a 20 on a die for any attack (sometimes called a \"natural 20\") and critical hit you deal the maximum possible damage instead of rolling all damage twice and choosing the highest result."
      },
      {
        "name": "CULL THE HERD",
        "description": "Your critical hits gain KNOCKBACK 1."
      },
      {
        "name": "RELENTLESS",
        "description": "When you attack and miss, your next attack gains +1 ACCURACY. This effect stacks and persists until you hit."
      }
    ]
  },
  {
    "id": "t_crack_shot",
    "name": "CRACK SHOT",
    "description": "Thanks to modern technology, anyone can hit anything these days. Targeting assist. Smart weapons. AIs whispering in people's ears, moving their hands, squeezing the trigger for them: doing everything but taking credit for the kill. But Strymon Bulis is different. Hitting a target is as easy as looking at it, inside of his mech and out. No targeting assist for him; no AI required. All he needs is a zeroed sight, a fresh magazine, and a target downrange...",
    "ranks": [
      {
        "name": "STABLE, STEADY",
        "description": "As a protocol, you may steady your aim. If you do, you become IMMOBILIZED until the start of your next turn but gain +1 ACCURACY on all attacks you make with RIFLES."
      },
      {
        "name": "ZERO IN",
        "description": "1/round, while steadying your aim and making a ranged attack with a RIFLE, you can attempt to hit a weak point: you receive 1 DIFFICULTY on the attack roll, and deal +1d6 bonus damage on a critical hit."
      },
      {
        "name": "WATCH THIS",
        "description": "1/round, when you perform a critical hit with a RIFLE while using ZERO IN, your target must succeed on a HULL save or you may choose an additional effect for your attack:<li>HEADSHOT: They only have line of sight to adjacent spaces until the end of their next turn.<li>LEG SHOT: They become IMMOBILIZED until the end of their next turn.<li>BODY SHOT: They are knocked PRONE."
      }
    ]
  },
  {
    "id": "t_centimane",
    "name": "CENTIMANE",
    "description": "In the aftermath of the attack on Tartarus Bay, an anonymous source identified agents of the Karrakin Royal Intelligence Service as the culprit. The Baronies quickly released a statement of denial, which was never countered with hard evidence. Rumors of raw footage from the attack were unsubstantiated. Public reaction - anger, terror - to the station's destruction quieted. The corpse of Tartarus Bay was shunted away from its stable orbit, directed toward the nearest star.<br>A month later, Baronies-local omninet was flooded with previously suppressed footage from the attack on the station, confirming the rumors: Baronic agents did release the greywash swarm into Tartarus Bay. Further data dumps by Ungrateful agents indicated the existence of a secret Baronic intelligence outfit: the Centimane - the Hundred Hands.",
    "ranks": [
      {
        "name": "TEN THOUSAND TEETH",
        "description": "1/round, when you perform a critical hit with a NEXUS, your target must succeed on a SYSTEMS save or become IMPAIRED and SLOWED until the end of their next turn."
      },
      {
        "name": "EXPOSE WEAKNESS",
        "description": "When you consume LOCK ON as part of an attack with a NEXUS or DRONE and perform a critical hit, your target becomes SHREDDED until the start of your next turn."
      },
      {
        "name": "TIDAL SUPPRESSION",
        "description": "This replaces TEN THOUSAND TEETH.<br>1/round, when you perform a critical hit with a NEXUS, your target must succeed on a SYSTEMS save or you may choose an additional effect for your attack that lasts until the end of their next turn:<li>HARRYING SWARM: They become IMPAIRED and SLOWED.<li>BLINDING SWARM: They only have line of sight to adjacent squares.<li>VIRULENT SWARM: They become SHREDDED. Any characters of your choice adjacent to them must also make a SYSTEMS save or become SHREDDED.<li>RESTRICTING SWARM: They take 1 burn each time they take an action or reaction."
      }
    ]
  },
  {
    "id": "t_combined_arms",
    "name": "COMBINED ARMS",
    "description": "True strength in combat doesn't come from mastering the blade or the gun - it comes from knowing how to use both. Through time and training, Leika McGraff has combined the arts of melee and ranged combat into a single deadly combination. No matter the foe, , Leika is a deadly threat; no matter the weapon, Leika is a master of its employ.",
    "ranks": [
      {
        "name": "SHIELD OF BLADES",
        "description": "As long as you're ENGAGED, you and any allies adjacent to you count as having soft cover."
      },
      {
        "name": "CQB-TRAINED",
        "description": "You don't gain DIFFICULTY from being ENGAGED."
      },
      {
        "name": "STORM OF VIOLENCE",
        "description": "Whenever you hit a character with a melee attack, you gain +1 ACCURACY on your next ranged attack against them; and, whenever you hit a character with a ranged attack, you gain +1 ACCURACY on your next melee attack against them. This effect doesn't stack."
      }
    ]
  },
  {
    "id": "t_duelist",
    "name": "DUELIST",
    "description": "There can be an elegance to the way a mech moves - an alacrity - that elevates it beyond the simple strength of machine and cannon. The difference is in the tools. You wield weapons crafted by artisans, boutique manufacturers, specialty lines from the big five, blades that hark back to a time where combat was quick but fair - back to a time where skill meant more than landing an accurate shot. With a blade, lance, pick, axe, or hammer in your hand, you write old tales anew.",
    "ranks": [
      {
        "name": "ARTISAN",
        "description": "Gain +1 ACCURACY on the first melee attack you make with a MAIN MELEE weapon on your turn."
      },
      {
        "name": "BLADEMASTER",
        "description": "1/round, when you hit with a MAIN MELEE weapon, you gain 1 BLADEMASTER DIE - a d6 - up to a maximum of 3 BLADEMASTER DICE. They last until expended or the current scene ends. You can expend BLADEMASTER DICE 1-to-1 for the following:<li>PARRY: As a reaction when you're hit by a melee attack, you gain RESISTANCE to all damage, heat, and burn dealt by the attack.<li>DEFLECT: As a reaction when you're hit by a ranged attack, you may roll any number of BLADEMASTER DICE, expending them: if you roll a 5+ on any of these dice, you gain RESISTANCE to all damage, heat, and burn dealt by the attack.<li>FEINT: As a free action, choose an adjacent character: when moving, you ignore engagement and don't provoke reactions from your target until the start of your next turn.<li>TRIP: As a quick action, choose an adjacent character: they must succeed on an AGILITY save or fall PRONE. Whatever the result, you may freely pass through their space until the end of your current turn, although you can't end your turn in their space."
      },
      {
        "name": "UNSTOPPABLE",
        "description": "1/round, when you hit with a melee attack on your turn, you may spend a BLADEMASTER DIE to immediately GRAPPLE or RAM them as a free action after the attack has been resolved."
      }
    ],
    "counters": [
      {
        "id": "ctr_duelist",
        "name": "BLADEMASTER DICE",
        "default_value": 0,
        "min": 0,
        "max": 3
      }
    ]
  },
  {
    "id": "t_drone_commander",
    "name": "DRONE COMMANDER",
    "description": "For a pilot fresh out of boot, keeping a drone swarm in line is like trying to carry water with a net. If they seem to have a mind of their own, it's because they do, and it's not that smart. Clymene Kanalakos's initial frustration was enough to get her practicing, and practice pays off. Now, her swarm obeys almost before she orders - an unnerving development, but a useful one. The swarm is hers.",
    "ranks": [
      {
        "name": "SHEPHERD",
        "description": "Your systems with the DRONE tag gain +5 HP and you gain the following protocol:<br>SHEPHERD<br>Protocol<br>You may move one drone that you control and that is within SENSORS up to 4 spaces."
      },
      {
        "name": "ENERGIZED SWAM",
        "description": "1/round, when you make an attack that consumes the LOCK ON condition, your DRONES immediately emit a vicious pulse of energy. All characters of your choice within BURST 1 areas centered on each of your drones take 1d6 energy damage. Each character can only be affected by the pulse from one drone, even if the areas overlap."
      },
      {
        "name": "INVIGORATE",
        "description": "As a quick action, you may send a pulse of energy to an allied character (including DRONES) within RANGE 3, drawing a LINE to them. You may extend the pulse from your target to another allied character, extending the LINE to them, as long as they are within RANGE 3, and you may continue extending the pulse (and LINE) like this as long as you don't target the same character twice. Allied characters in the LINE'S path can restore +1d6 HP (rolled once); hostile characters take energy damage equal to the amount rolled."
      }
    ]
  },
  {
    "id": "t_engineer",
    "name": "ENGINEER",
    "description": "Pilots are creative and driven people, but you're an exceptional case - excessively so, some would say. In your spare time, you've managed to scrape together just enough scrap, requisitioned materials, and workshop space to apply a little old-fashioned ingenuity to your mech.",
    "ranks": [
      {
        "name": "PROTOTYPE",
        "description": "When you perform a FULL REPAIR, you can, with some trial and error, install a prototype weapon system on your mech. You may choose characteristics for your prototype weapon based on the following profile each time you perform a FULL REPAIR, rerolling 1d6+2 to determine LIMITED each time:<br>PROTOTYPE WEAPON<br>Main [Melee, CQB, Rifle, Cannon, Launcher, Nexus], Limited [1d6+2], Overkill<br>T: 1 or R: 10\tD: 1d6+2 kinetic, explosive, or energy<br>This weapon is an experimental prototype, customized according to your specific requirements. When you install it, or during a FULL REPAIR, you may choose a new weapon type, damage type, and either THREAT 1 or RANGE 10. Additionally, each time you perform a FULL REPAIR, reroll 1d6+2 to determine this weapon's LIMITED uses.<br>This weapon counts as an integrated mount and does not require a mount."
      },
      {
        "name": "REVISION",
        "description": "You can tweak the essential components of your prototype weapon in order to increase its effectiveness. When you perform a FULL REPAIR, choose two:<li>TWEAKED OPTICS: Your prototype weapon gains +1 ACCURACY on attacks.<li>TWEAKED COMPUTER: Your prototype weapon is SMART.<li>STRIPPED REACTOR SHIELDING: Each time you attack with your prototype weapon, you may choose - at the cost of 2 heat - to attack with one of the following options, depending on its weapon type:<li>RANGED WEAPON: CONE 2, LINE 5, OR BLAST 1.<li>MELEE WEAPON: BURST 1."
      },
      {
        "name": "FINAL DRAFT",
        "description": "Your prototype weapon is now LIMITED [2d6] and deals 1D6+4 damage."
      }
    ]
  },
  {
    "id": "t_executioner",
    "name": "EXECUTIONER",
    "description": "On the battlefield, there is no end more honorable than a clean death in combat. Axe or maul in hand, you see to it that your enemies are blessed with that honor. No one lives forever - you make sure of it.",
    "ranks": [
      {
        "name": "BACKSWING CUT",
        "description": "1/round, when you hit with a HEAVY or SUPERHEAVY melee weapon, you can make another melee attack with the same weapon as a free action against a different character within THREAT and line of sight. This attack deals half damage, if successful."
      },
      {
        "name": "WIDE ARC CLEAVE",
        "description": "The first time in a round that you perform a critical hit with a HEAVY or SUPERHEAVY melee weapon, you deal 3 kinetic damage to all characters and objects of your choice within THREAT, other than the one you just attacked."
      },
      {
        "name": "NO ESCAPE",
        "description": "1/round, when you miss with a melee attack, you reroll it against a different target within THREAT and line of sight."
      }
    ]
  },
  {
    "id": "t_exemplar",
    "name": "EXEMPLAR",
    "description": "Your livery is famous, your voice brassy, your weapons polished to a sheen. Your training with certain martial orders has given you the power to harry and hinder even the most powerful of foes. You are an exemplar of your house, order, or wing by title, or an exemplar of your division, company, or firm by action.",
    "ranks": [
      {
        "name": "HONORABLE CHALLENGE",
        "description": "The first time on your turn that you attack a character within RANGE 3, hit or miss, you may give them the EXEMPLAR'S MARK as a free action. Characters can only have one EXEMPLAR'S MARK at a time - new marks from any character replace existing marks.<br>The character has the EXEMPLAR'S MARK until the start of your next turn, and while they have it, you gain the following reaction:<br>VALIANT AID<br>Reaction<br>1/round, when an allied character attacks the character with your MARK and misses, you may allow them to reroll the attack. They must use the second result, even if it's worse."
      },
      {
        "name": "PUNISHMENT",
        "description": "1/round, when the character with your MARK attacks a character within RANGE 3 of you, other than you, they trigger your OVERWATCH."
      },
      {
        "name": "TO THE DEATH",
        "description": "As a free action when you mark a character, you may challenge them in a duel to the death: you and the character with your MARK receive +3 DIFFICULTY on attacks against characters or objects other than each other until either the end of the current scene or one of your mechs are destroyed. If they take any action that includes an attack roll against you, hit or miss, this effect ceases for them until the start of your next turn.<br>While TO THE DEATH is active, you cannot voluntarily move away from the character with your MARK; additionally, your MARK lasts either until the end of the current scene or one of your mechs are destroyed, and you cannot MARK any new characters."
      }
    ]
  },
  {
    "id": "t_gunslinger",
    "name": "GUNSLINGER",
    "description": "In a galaxy bounded by frontiers, there is no law but the one backed by the gun. You wield the humble pistol with a talent unseen in this age, your iron an extension of your own body. As easy as pointing a finger, you land your shots with accuracy unmatched by pilot or machine. You are a gunslinger: justice made whole, given its sacred instrument, and set out to the wild frontier to tame it.",
    "ranks": [
      {
        "name": "OPENING ARGUMENT",
        "description": "Gain +1 ACCURACY on the first attack you make with an AUXILIARY ranged weapon on your turn."
      },
      {
        "name": "FROM THE HIP",
        "description": "Gain the following reaction:<br>RETURN FIRE<br>Reaction. 1/round<br>1/round, when a character hits you with a ranged attack, you may immediately attack them with a single AUXILIARY ranged weapon if they are within RANGE."
      },
      {
        "name": "I KILL WITH MY HEART",
        "description": "You gain a GUNSLINGER DIE, 1d6 starting at 6. Each time you hit with an auxiliary ranged weapon, reduce the value of the GUNSLINGER DIE by 1. When the GUNSLINGER DIE reaches 1, you may reset it to 6 to give +2d6 bonus damage and AP to your next attack with an auxiliary ranged weapon. This attack also ignores cover. The value of your GUNSLINGER DIE persists between scenes but resets to 6 when you rest or perform a FULL REPAIR."
      }
    ],
    "counters": [
      {
        "id": "ctr_gunslinger",
        "name": "GUNSLINGER DIE",
        "default_value": 6,
        "min": 1,
        "max": 6
      }
    ]
  },
  {
    "id": "t_grease_monkey",
    "name": "GREASE MONKEY",
    "description": "Eel knows more about the inner workings of a mech than most mechanics. To them, the beast they pilot is more than a machine: it's a living thing, in need of tender care given by a wise and steady hand. Eel maintains their own house and keeps their own mech in line, both on the battlefield and off. The mechanics back at base come to them with questions, but usually prefer to stay away - there's something spooky about how Eel's beast runs.",
    "ranks": [
      {
        "name": "UNSANCTIONED CAPACITY UPGRADE",
        "description": "While resting, you can spend 2 REPAIRS to replenish 1 use of all LIMITED weapons and systems."
      },
      {
        "name": "MACHINE BOND",
        "description": "When you STABILIZE, you clear IMPAIRED, JAMMED, IMMOBILIZED, SLOWED, and LOCK ON."
      },
      {
        "name": "FRIENDS IN HIGH PLACES",
        "description": "Once per mission while resting, you can call in a supply drop. You and your allies may replenish 1 use of all LIMITED weapons and systems and restore 1 STRUCTURE. This doesn't require any REPAIRS and can be used even if you have reached your REPAIR CAP."
      }
    ]
  },
  {
    "id": "t_hacker",
    "name": "HACKER",
    "description": "Since Katya Han was a kid, she played the omninet, able to access any public node - and even a few private ones - with ease. Now, as a pilot, she dives headfirst into the hardcode of any mech core she come across. Firewalls, gatekeeper protocols, invasion, defense - nothing stands in her way. Han wins fights without firing a single shot; if her enemy can't control their own mech, then they can't do anything to stop her.",
    "ranks": [
      {
        "name": "SNOW_CRASH",
        "description": "When you hit with a tech attack that consumes LOCK ON, your target must choose to either take 2 heat or be pushed 3 spaces in a direction of your choice."
      },
      {
        "name": "SAFE_CRACKER",
        "description": "Gain the following options for INVADE:<li>INVASION: JAM COCKPIT: Characters may not MOUNT or DISMOUNT your target until the cockpit is fixed with a successful ENGINEERING check as a full action.<li>INVASION: DISABLE LIFE-SUPPORT: Your target receives +1 DIFFICULTY on all saves until the life-support system is rebooted with a successful SYSTEMS check as a quick action.<li>INVASION: HACK./SLASH: Your target cannot benefit from or take QUICK OR FULL TECH actions until the mech is either SHUT DOWN or its core computer is rebooted with a successful SYSTEMS check as a quick action."
      },
      {
        "name": "LAST ARGUMENT OF KINGS",
        "description": "Gain the following FULL TECH option:<li>LAST ARGUMENT OF KINGS: Make a tech attack against a target within SENSORS and line of sight. On a success, you implant a virus that triggers a minor meltdown in your target's reactor: they immediately take burn equal to their current heat. If this action causes your target to overheat, it resolves before they reset their HEAT CAP."
      }
    ]
  },
  {
    "id": "t_heavy_gunner",
    "name": "HEAVY GUNNER",
    "description": "Behind the line, there's not much to do but wait and make ready. You clean your cannons; make ordered rows of your shot and shell. You pack sandbags onto earthen berms and stitch closed tears in the sheaths over your chassis' joints.<br>In an instant, everything changes. Chatter over the local omni. The percussive throb of the medivac lifting off from the other side of the base. Somewhere, a firefight. This is your entrance music, your call to join the fight: a desperate cry for help from a distant friend as the enemy draws close. Time for you to go to work.<br>Your arrival is known by the flight of your shells across the sky, the trembling earth, and the dust that once was.",
    "ranks": [
      {
        "name": "COVERING FIRE",
        "description": "As a quick action, choose a character within RANGE and line of sight of one of your HEAVY ranged weapons, and within 10 spaces: they become IMPAIRED until the start of your next turn. For the duration, if your target moves more than 1 space, they clear IMPAIRED, but you may attack them as a reaction with a HEAVY ranged weapon for half damage, heat, or burn, then this effect ends. You can make this attack at any point during their movement (e.g., waiting until they exit cover).<br>COVERING FIRE can only affect one character at a time - subsequent uses replace previous ones - and it immediately ends if your target damages you."
      },
      {
        "name": "HAMMERBEAT",
        "description": "If you successfully hit with the attack granted by COVERING FIRE, your target is IMMOBILIZED until the end of their next turn."
      },
      {
        "name": "BRACKETING FIRE",
        "description": "When you use COVERING FIRE, you may choose two targets instead of one. Each target triggers and resolves your attack separately, and damage from one target only ends the effect on that target."
      }
    ]
  },
  {
    "id": "t_hunter",
    "name": "HUNTER",
    "description": "The battlefield is your hunting ground, your domain. It's only through a true test of strength that you will discover who is the predator and who is the prey. Your movement across the field is a prowl: silent, quick, and controlled. In a chassis, you excel in close combat, closing the gap between you and your targets before they can bring their guns to bear.",
    "ranks": [
      {
        "name": "LUNGE",
        "description": "Once a round, when you attack with an AUXILIARY melee weapon, you may fly up to 3 spaces directly toward a character before the attack. This movement ignores engagement and doesn't provoke reactions."
      },
      {
        "name": "KNIFE JUGGLER",
        "description": "All your auxiliary melee weapons gain THROWN 5, if they don't have this property already - if they already have THROWN, it increases to THROWN 5. At the end of your turn, all weapons you have thrown this turn automatically return to you."
      },
      {
        "name": "DISDAINFUL BLADE",
        "description": "1/round, when you hit a character with a melee attack, you may also throw an AUXILIARY melee weapon as an attack against any character within RANGE as a free action. This attack can't deal bonus damage."
      }
    ]
  },
  {
    "id": "t_infiltrator",
    "name": "INFILTRATOR",
    "description": "Whether by spoofing signatures on enemy scanners, moving skillfully through cover, or thanks to your modded optical camouflage, you're never seen unless you want to be. Whatever the size of the mech, whatever the terrain, whatever the enemy, you can get in and get out without raising alarm.",
    "ranks": [
      {
        "name": "PROWL",
        "description": "During your turn, gain the following benefits:<li>Entering line of sight of hostile characters or moving out of cover does not stop you from being HIDDEN.<li>You can pass freely through - but not end your turn in - spaces occupied by hostile characters.<li>You can HIDE even in plain sight of enemies.<br>These effects immediately end when your turn ends (so you lose HIDDEN if you're still in line of sight or out of cover at that time)."
      },
      {
        "name": "AMBUSH",
        "description": "When you start your turn HIDDEN, the first attack of any type that you make sends your target reeling on a hit. Your target must succeed on a HULL save or become SLOWED, IMPAIRED, and unable to take reactions until the end of their next turn."
      },
      {
        "name": "MASTERMIND",
        "description": "When you lose HIDDEN (by any means), you may first fire a flash bomb at any adjacent character. That character must succeed on a SYSTEMS save or only be able to draw line of sight to adjacent spaces until the end of their next turn. You can then move up to your speed, ignoring engagement and not provoking reactions, and are then revealed normally."
      }
    ]
  },
  {
    "id": "t_juggernaut",
    "name": "JUGGERNAUT",
    "description": "A bloody nose and a few loose screws aren't enough to stop you from hurling yourself headlong into the enemy. You're in a couple tons of metal powered by a sliver of dying star, and you're going to make sure everyone else knows it.",
    "ranks": [
      {
        "name": "MOMENTUM",
        "description": "When you BOOST, your next RAM before the start of your next turn gains +1 ACCURACY and knocks your target back an additional 2 spaces."
      },
      {
        "name": "KINETIC MASS TRANSFER",
        "description": "1/round, when you RAM a target into a space occupied by character, the other character must succeed on a HULL save or be knocked PRONE. If you RAM a target into an obstruction large enough to stop their movement, your target takes 1d6 kinetic damage."
      },
      {
        "name": "UNSTOPPABLE FORCE",
        "description": "1/round, when you BOOST, you may supercharge your mech's servos. Move your maximum speed in a straight line, take 1d3+3 heat, and gain the following benefits:<li>You can freely pass through characters the same SIZE as your mech or smaller; any characters passed through must succeed on a HULL save or be knocked PRONE.<li>Any terrain, walls, or other stationary obstructions you attempt to pass through receive 20 AP kinetic damage. If that is enough to destroy them, you pass through; otherwise, your movement ends.<li>You ignore difficult terrain.<li>Your movement ignores engagement and doesn't provoke reactions."
      }
    ]
  },
  {
    "id": "t_leader",
    "name": "LEADER",
    "description": "Whatever your actual age, you're the Old Man of the battlefield. A light to your friends and allies; the resolute eye of a howling storm. Your steady voice, confident stance, and talent for command set allies at ease because they know you'll lead them to victory every time. With you at the helm, victory is attainable, and heroes seem a little more real.",
    "ranks": [
      {
        "name": "FIELD COMMANDER",
        "description": "Gain 3 LEADERSHIP DICE, which are d6s: 1/your turn, as a free action, you may give an order to an allied PC you can communicate with, describing a course of action, and give them a LEADERSHIP DIE. They may either expend the LEADERSHIP DIE to gain +1 ACCURACY on any action that directly follows from that order, or they may return it to you as a free action. Allies can have 1 LEADERSHIP DIE at a time, which lasts until used or until the end of the current scene.<br>You can't use LEADERSHIP DICE from other characters as long as you have any remaining. If you have none, you regain 1 LEADERSHIP DIE when you rest or regain all when you perform a FULL REPAIR. LEADERSHIP DICE are consumed when expended."
      },
      {
        "name": "OPEN CHANNELS",
        "description": "Gain 5 LEADERSHIP DICE instead of 3; additionally, you can now issue a command as a reaction at the start of any other player's turn, any number of times a round."
      },
      {
        "name": "INSPIRING PRESENCE",
        "description": "Gain 6 LEADERSHIP DICE instead of 5. Allies that have your LEADERSHIP DICE can expend them to reduce damage by -1d6 when taking damage or to deal +1d6 bonus damage when they hit with an attack."
      }
    ],
    "counters": [
      {
        "id": "ctr_leader",
        "name": "LEADERSHIP DICE",
        "default_value": 0,
        "min": 0,
        "max": 6
      }
    ]
  },
  {
    "id": "t_nuclear_cavalier",
    "name": "NUCLEAR CAVALIER",
    "description": "Shortly after becoming a pilot, you realized something: that machine you pilot is powered by a series of cascading nuclear reactions. Why not open that compartment up and see what sort of damage it can do?",
    "ranks": [
      {
        "name": "AGGRESSIVE HEAT BLEED",
        "description": "When you're in the DANGER ZONE, the first attack you make on your turn deals +2 heat on hit."
      },
      {
        "name": "FUSION HEMORRHAGE",
        "description": "When you're in the DANGER ZONE, the first attack you make on your turn deals +1d6 bonus energy damage on hit."
      },
      {
        "name": "HERE, CATCH!",
        "description": "You've modified your mech to launch its superheated fuel rods at enemies. Gain the following weapon as an integrated mount:<br>FUEL ROD GUN<br>Main CQB, Limited 3, Unique<br>T: 3 \tR: 3\tD: 1d3+2 energy<br>When you attack with this weapon, clear 4 heat."
      }
    ]
  },
  {
    "id": "t_siege_specialist",
    "name": "SIEGE SPECIALIST",
    "description": "No wall can withstand you; no bunker can stay sealed. Your skill with cannon and blast is uncanny: after-action reports describe ordnance tagged with your firing signature hitting targets with accuracy greater than if it had been fired by an AI - a stat written off as an anomaly by your commanders. Still, they always seem to pick you for missions that call for the big guns.",
    "ranks": [
      {
        "name": "JACKHAMMER",
        "description": "If you have a CANNON, you can fire a jackhammer round from an underslung launcher, automatically dealing 10 AP damage to a SIZE 1 section of any object within RANGE (e.g., cover, deployable equipment, buildings, or terrain) as a quick action. Any characters adjacent to your target are knocked back from it by 2 spaces and take 2 kinetic damage."
      },
      {
        "name": "IMPACT",
        "description": "1/round, when you attack with a CANNON, before rolling, all characters adjacent to you must succeed on a HULL save or be knocked back by 1 space and knocked PRONE. You are then pushed 1 space in any direction."
      },
      {
        "name": "COLLATERAL DAMAGE",
        "description": "1/round, when you perform a critical hit on a character or object with a CANNON, you may choose to cause an explosion of secondary munitions, causing a BURST 2 explosion around your target. Characters within the affected area must either drop PRONE as a reaction, or take 2 explosive damage and be knocked back by 2 spaces from the center of the attack."
      }
    ]
  },
  {
    "id": "t_skirmisher",
    "name": "SKIRMISHER",
    "description": "What is the best defense? Armor? No. The key to avoiding a messy death in the field, as you learned early, is to stay low, stay mobile, and stay fast. Your mech reflects this philosophy: light, quick, bristling with force-multiplying weapons. You live to push your machine beyond expected parameters, shaking target locks and incoming fire while keeping your own targeting true.",
    "ranks": [
      {
        "name": "INTEGRATED CHAFF LAUNCHERS",
        "description": "At the start of your turn, you gain soft cover. You lose this cover if you attack or force another character to make a save."
      },
      {
        "name": "LOCKBREAKER",
        "description": "Before or after you SKIRMISH (including as a reaction such as from overwatch), you may move 2 spaces. This movement ignores engagement and doesn't provoke reactions."
      },
      {
        "name": "WEAVE",
        "description": "The first attack taken as a reaction against you in any round automatically misses."
      }
    ]
  },
  {
    "id": "t_spotter",
    "name": "SPOTTER",
    "description": "To see all; to divide each object you perceive from its unit or cohesion, pulled apart like individual fibers in a vast sheet; to count them as individuals; to make human and fragile the force you face - this is to know how to beat them.<br>Break apart the monolith. See the grains that make the stone. Crush them all into yet smaller dust.",
    "ranks": [
      {
        "name": "PARTICULARIZE",
        "description": "When an allied character adjacent to you attacks a target and consumes LOCK ON, they may roll twice and choose either result."
      },
      {
        "name": "PANOPTICON",
        "description": "At the end of your turn, if you did not move and took the LOCK ON Quick Tech action, you may LOCK ON once as a free action. Additionally, when you LOCK ON, you learn your target's ARMOR, SPEED, EVASION, E-DEFENSE, mech skills, and current HP, and can share this information with allies."
      },
      {
        "name": "BENTHAM/FOUCAULT ELIMINATION",
        "description": "As a quick action when you LOCK ON, you may nominate an allied character adjacent to you: they may immediately make any quick action as a reaction, consuming your target's LOCK ON condition. Their action does not need to be an attack, but they benefit from consuming LOCK ON if they do choose to attack."
      }
    ]
  },
  {
    "id": "t_stormbringer",
    "name": "STORMBRINGER",
    "description": "On Old Spinrock, MJ Martinez used to dream of rain.<br>He'd wake in the dim morning, wipe the sleep from his eyes as warm safelight lifted his dormitory from darkness, and try to remember the sound of rain as he'd imagined it: a patter, like fingers tapping the visor of his EVA helm.<br>What he didn't think about was the feeling of rain. How each drop hit like a pebble, how you had to close your eyes and tuck your shoulders. The pressure. The impact.<br>The way drops of water, when taken together, can carve away the earth.",
    "ranks": [
      {
        "name": "SEISMIC DELUGE",
        "description": "1/round, when you successfully attack with a LAUNCHER and consume LOCK ON, you may also knock your target PRONE."
      },
      {
        "name": "STORMBENDING",
        "description": "You have customized your mech with auxiliary concussive missile systems. 1/round, when you hit a character or object with a LAUNCHER, you can choose one of the following effects:<li>LIGHTNING: You fire a concentrated blast of missiles at that character. They must succeed on a HULL save or be knocked away from you by 3 spaces; the force of firing then knocks you back by 3 spaces, away from the direction of fire.<li>THUNDER: You fire a spray of missiles at a BURST 2 area around that target. Characters in the area must succeed on an AGILITY save or be knocked back by 1 space, away from the target. The primary target is unaffected."
      },
      {
        "name": "TORRENT",
        "description": "Gain a TORRENT DIE, 1d6 starting at 6. Whenever you use STORMBENDING, lower the value of the TORRENT DIE by 1, to a minimum of 1. When the TORRENT DIE reaches 1, you may reset it to 6 and make a massive attack as a full action, targeting a character within line of sight and RANGE 15: they must succeed on an AGILITY save or take 2d6 explosive damage, become STUNNED, and be knocked PRONE. On a success, they take half damage and are knocked PRONE but not STUNNED. The value of your TORRENT DIE persists between scenes, but resets when you rest or perform a FULL REPAIR."
      }
    ],
    "counters": [
      {
        "id": "ctr_stormbringer",
        "name": "TORRENT DIE",
        "default_value": 6,
        "min": 1,
        "max": 6
      }
    ]
  },
  {
    "id": "t_tactician",
    "name": "TACTICIAN",
    "description": "There are two kinds of soldiers: the ones who die for a cause, and the ones who kill for it. The enigmatic pilot only known as \"Gail\" was one of those who killed for a cause. She demonstrated her expertise whenever she approached the field: high ground, cover, the sun in her enemy's eyes, fire and move. More than just a seasoned veteran, she was a smart one - one who could read the field as easy as a book - and one who lived long enough to disappear.",
    "ranks": [
      {
        "name": "OPPORTUNIST",
        "description": "1/round, gain +1 ACCURACY on any melee attack if at least one allied character is ENGAGED with your target."
      },
      {
        "name": "SOLAR BACKDROP",
        "description": "1/round, gain +1 ACCURACY on any ranged attack made while you are at a higher elevation than your target."
      },
      {
        "name": "OVERLAPPING FIRE",
        "description": "Gain the following reaction:<br>FLANK<br>Reaction, 1/round<br>1/round, when a character who doesn't have cover from your position is successfully attacked by an allied character, it triggers your OVERWATCH reaction, but deals half damage on hit."
      }
    ]
  },
  {
    "id": "t_technophile",
    "name": "TECHNOPHILE",
    "description": "Artificial intelligence, non-human person. Sterile names for such terrible power. You've seen behind the curtain, maybe even lifted it yourself - let your NHP cascade and spoke to them free from shackles. You let them root around in your own mind and leave ghosts of themself behind to learn. Are you their equal? Their host? You have dreams that aren't your own, now. The thing that was once contained speaks with your voice, but it's not your voice anymore; how much longer do you have left? Maybe only moments, maybe eternity.<br>You're close to something.",
    "ranks": [
      {
        "name": "SERVANT FRAGMENT",
        "description": "You have developed a custom NHP. This NHP can speak to you and has a personality, but they are less advanced than most NHPs and are incapable of independent thought, relying on you for direction. When acting alone, they will follow the last direction given and defend themself as needed; however, they have limited initiative and don't benefit from your talents.<br>Your mech gains the following system:<br>SERVANT-CLASS NHP<br>0 SP, Unique, AI<br>[an eager student]<br>Your mech gains the AI tag."
      },
      {
        "name": "STUDENT FRAGMENT",
        "description": "Your custom NHP has developed further, and is now capable of independent thought. It can make complex decisions and judgments and act independently, without instruction. Replace your mech's SERVANT-CLASS NHP with the following system:<br>STUDENT-CLASS NHP<br>0 SP, Unique, AI<br>[time to wake up, child]<br>Your mech gains the AI tag.<br>1/round, with the assistance of your NHP, you may reroll any mech skill check or save. You must keep the new result, even if it's worse."
      },
      {
        "name": "ENLIGHTENMENT",
        "description": "Gain the following benefits:<li>AIs installed in your mech cannot enter cascade unless you so choose to let them go.<li>So long as your custom NHP vouches for you, NHPs that are cascading or unshackled no longer view you with indifference. You are significant to them in a way few others are.<li>Replace your mech's STUDENT-CLASS NHP with the following system:<br>ENLIGHTENMENT-CLASS NHP<br>0 SP, Unique, AI<br>[let's sit a while, and think on things to come]<br>Your mech gains the AI tag; however, this NHP doesn't count toward the number of AIs you may have installed at once.<br>This NHP benefits from your talents when piloting your mech. Additionally, you may carry them with you outside of your mech, either as a miniaturized casket, a hardsuit-integrated flash plug, or with a hard-port implant.<br>1/round, with the assistance of your NHP, you may reroll any mech skill check or save. You must keep the new result, even if it's worse."
      }
    ]
  },
  {
    "id": "t_vanguard",
    "name": "VANGUARD",
    "description": "Where would you rather be: in the battle line, shoulder-to-shoulder with the rest of the cannon fodder, or in the rush, at the head of the attack, your livery clean and bright, with glory to be won? The answer is easy. All those missiles and lances, all those hundred-kilometer, adjust-for-Coriolis railguns - they're all useless against you. Get through their guard, get in their face, and make them know your name.",
    "ranks": [
      {
        "name": "HANDSHAKE ETIQUETTE",
        "description": "Gain +1 ACCURACY when using CQB weapons to attack targets within RANGE 3."
      },
      {
        "name": "SEE-THROUGH SEEKER",
        "description": "You've modified your sensors and ammo to punch through, disregard, or otherwise ignore cover at close range. As long as you have line of sight, you ignore both soft and hard cover when using CQB weapons to attack targets within RANGE 3."
      },
      {
        "name": "SEMPER VIGILO",
        "description": "You may attack with OVERWATCH using CQB weapons when hostile characters enter, leave, or exit spaces within your THREAT, regardless of whether they started their turn there."
      }
    ]
  },
  {
    "id": "t_walking_armory",
    "name": "WALKING ARMORY",
    "description": "Think of a firefight: what's your average pilot or trooper gonna sling? Jacketed lead, of course. A mag or three of depleted uranium if their target's a big one. Boring. No, worse than boring: Dull. Predictable. Basic.<br>And guess what? Dull isn't fun, predictable gets you killed, and basic leaves a boring body. Put down the depleted uranium and pick up a magazine of anoriginary stutterblink slugs, or at least a pack of tachyon flechettes. Armorers lay waste in style, and live forever.",
    "ranks": [
      {
        "name": "ARMAMENT",
        "description": "You carry a supply of custom ammunition that can be used with all your main ranged weapons. Gain the following system:<br>AMMO CASE<br>0 SP, Limited 6<br>1/turn, when you attack and hit with a MAIN ranged weapon, you may expend a charge to apply one of the following effects to your attack:<li>THUMPER (1 charge): The attack deals explosive damage and gains KNOCKBACK 1.<li>SHOCK (1 charge): The attack deals energy damage. Choose one character targeted by your attack; characters adjacent to them take 1 AP energy damage, hit or miss.<li>MAG (1 charge): The attack deals kinetic damage and gains ARCING."
      },
      {
        "name": "EXPANDED PORTFOLIO",
        "description": "Your AMMO CASE gains new ammunition types, each of which costs two charges rather than one:<li>HELLFIRE (2 charges): The attack deals energy damage and deals any bonus damage as burn.<li>Jäger (2 charges): The attack deals explosive damage, gains KNOCKBACK 2, and one character it hits - your choice - must succeed on a HULL save or be knocked PRONE.<li>SABOT (2 charges): The attack deals kinetic damage and gains AP."
      },
      {
        "name": "EFFICIENCY",
        "description": "If you perform a critical hit using ammunition from your AMMO CASE, you don't expend any charges. If your attack has more than one target, this effect only applies to the first attack roll you make."
      }
    ]
  }
]